// По нажатию на кнопку .js-time показывать, сколько секунд прошло после открытия странички (`You opened this page ${sec} seconds ago`);

// const btnRef = document.querySelector('.js-time');

////////////////////////////////////////////

//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//////////////////////////////////////////////

// Выведите в консоль текущие день, месяц и год в формате '2022-02-09'.

// const padNum = num => String(num).padStart(2, 0);

//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
////////////////////////////////////////////////

// Выведите в консоль количество часов, прошедшее между 8 февраля и текущим моментом

//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//////////////////////////////////////////////////

/*
 * Есть инпут, в который пользователь вводит дату своего рождения в формате '1995-12-31' (с конкретным годом).
 * По нажатию кнопки выведите под инпутом сколько дней осталось до его дня рождения: `${diff} days left`
 * Если Unix время юзера и сегодня совпадают после сброса в обеих датах часов, минут, сек и милисек в 0, (или если дата и месяц совпадают с сегодняшним) - вывести 'Today is your birthday!')
 * * Проверять формат - если неверный, то выводить сообщение 'Wrong format' и очистить resultRef
 */

// const btnRef = document.querySelector('[data-action="count-days"]');
// const resultRef = document.querySelector('.days-left');
// const inputRef = document.querySelector('.date');

// inputRef.value = '1995-11-18';
